# With Clause

WITH is primarily used for further projection or aggregation of current data. Next, we will introduce related usage from these two aspects.

## Aggregation

Aggregation is similar to the GROUP BY operation in SQL, which groups current data by properties and performs corresponding operations of aggregate functions on each group's data. NeuG currently supports mainstream aggregation functions, including:
- COUNT
- COUNT_STAR
- COLLECT
- SUM
- MIN
- MAX
- AVG

We will introduce these functions in detail in the [Aggregate Function Section](../../expression/agg_func).

### Aggregate by Single Property
```
MATCH (a) WITH label(a) AS label, count(a.name) AS cnt RETURN label, cnt;
```

<!-- todo: label is not included in current package -->

### Aggregate by Multiple Properties
```
MATCH (a)-[b:KNOWS]->(c) WITH label(a) AS a_label, label(c) AS c_label, count(b) AS cnt RETURN a_label, c_label, cnt;
```

### Apply Multiple Aggregate Functions
```
MATCH (a)-[b:KNOWS]->(c) WITH label(a) AS a_label, label(c) AS c_label, count(b) AS cnt, sum(b.weight) AS weights RETURN a_label, c_label, cnt, weights;
```

### Filter based on Aggregation Results

```
MATCH (a:Person) WITH label(a) AS label, count(a.name) AS cnt WHERE cnt > 2 RETURN label, cnt;
```

<!-- todo: label is null in output -->

## Projection

Another common usage of WITH is to further project current results by columns, which is equivalent to Column Pruning in SQL, outputting only the columns needed for subsequent queries.

## Project Node Data

```
MATCH (a:Person {name: 'marko'})-[:KNOWS]->(b:Person)
WITH b
MATCH (b)-[:CREATED]->(c)
RETURN c.name;
```

<!-- todo: multiple match is not included in current package -->

## Project Node/Edge Data

```
MATCH (a:Person {name: 'marko'})-[k:KNOWS]->(b:Person)
WITH b, k
MATCH (b)-[:CREATED]->(c)
RETURN k.weight, c.name;
```

## Project Properties
```
MATCH (a:Person {name: 'marko'})-[:KNOWS]->(b:Person)
WITH a, b.age AS b_age
MATCH (a)-[:CREATED]->(c)
WHERE b_age > 20
RETURN c.name;
```

Project the properties of the b data generated by the first Match, filter the properties through Filter, and finally output all c.name that meet the conditions;